Revit 2024 API
ElementMulticategoryFilter Class
 A filter used to find elements whose category matches any of a given set of categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class ElementMulticategoryFilter : ElementQuickFilter
Visual Basic
Public Class ElementMulticategoryFilter _
	Inherits ElementQuickFilter
Visual C++
public ref class ElementMulticategoryFilter : public ElementQuickFilter
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementMulticategoryFilter
See Also
ElementMulticategoryFilter Members
Autodesk.Revit.DB Namespace